In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
from datetime import datetime as dt
import plotly.express as px


%matplotlib inline

In [2]:
#Pulling in zillow inventory csv
inventory = pd.read_csv('../data/zillow_inventory.csv')

In [3]:
inventory.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2018-03-31,2018-04-30,2018-05-31,2018-06-30,2018-07-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
0,102001,0,United States,country,NaN,1424090.0,1502795.0,1594976.0,1663124.0,1711611.0,...,738696.0,671888.0,692258.0,739342.0,823214.0,907856.0,992241.0,1050164.0,1058568.0,1034548.0
1,394913,1,"New York, NY",msa,NY,73707.0,80345.0,85864.0,90067.0,91881.0,...,43468.0,39614.0,41249.0,44579.0,48962.0,52255.0,54874.0,55245.0,54335.0,51915.0
2,753899,2,"Los Angeles, CA",msa,CA,21998.0,23784.0,25605.0,27109.0,28811.0,...,13764.0,12851.0,14003.0,15277.0,16794.0,18264.0,20010.0,21199.0,21350.0,20723.0
3,394463,3,"Chicago, IL",msa,IL,38581.0,42253.0,45757.0,47492.0,48984.0,...,24881.0,21732.0,22202.0,23672.0,26136.0,28137.0,29939.0,30827.0,30449.0,29301.0
4,394514,4,"Dallas, TX",msa,TX,24043.0,25876.0,28225.0,30490.0,32408.0,...,15937.0,14301.0,14351.0,14544.0,15659.0,17345.0,19917.0,21753.0,22220.0,21699.0

In [4]:
#pulling in average list price csv
list_price = pd.read_csv('../data/zillow_list_and_sales_price.csv')

In [5]:
list_price.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2018-03-31,2018-04-30,2018-05-31,2018-06-30,2018-07-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
0,102001,0,United States,country,NaN,263267.0,271267.0,276300.0,279667.0,279967.0,...,331667.0,336667.0,349000.0,364967.0,379933.0,391267.0,397633.0,396000.0,392967.0,388300.0
1,394913,1,"New York, NY",msa,NY,503000.0,513000.0,521300.0,526300.0,528300.0,...,593333.0,604333.0,615667.0,631880.0,641880.0,648546.0,642333.0,634333.0,627667.0,632983.0
2,753899,2,"Los Angeles, CA",msa,CA,721333.0,735000.0,743333.0,750000.0,749667.0,...,866000.0,882623.0,905938.0,926238.0,942948.0,949967.0,949667.0,941333.0,932967.0,916633.0
3,394463,3,"Chicago, IL",msa,IL,284600.0,294600.0,300600.0,302267.0,301967.0,...,284966.0,287967.0,297667.0,309300.0,317967.0,323300.0,323983.0,320649.0,317316.0,313300.0
4,394514,4,"Dallas, TX",msa,TX,322997.0,328497.0,331797.0,332800.0,329502.0,...,381053.0,387632.0,394332.0,405998.0,418300.0,431633.0,438267.0,434967.0,428300.0,418333.0

In [6]:
#pulling in sales count csv
sales_count = pd.read_csv('../data/zillow_sales_count.csv')

In [7]:
sales_count.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2008-02-29,2008-03-31,2008-04-30,2008-05-31,2008-06-30,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
0,102001,0,United States,country,NaN,152555.0,182505.0,203819.0,222841.0,237188.0,...,301409.0,272483.0,364536.0,355886.0,378308.0,396505.0,339108.0,356134.0,326291.0,311761.0
1,394913,1,"New York, NY",msa,NY,7435.0,7995.0,8675.0,8925.0,9499.0,...,17074.0,13356.0,15221.0,13577.0,14188.0,15546.0,16409.0,17201.0,14690.0,12571.0
2,753899,2,"Los Angeles, CA",msa,CA,3263.0,3854.0,4684.0,5205.0,5323.0,...,6395.0,6269.0,9096.0,8740.0,8313.0,8113.0,6678.0,6935.0,6511.0,6113.0
3,394463,3,"Chicago, IL",msa,IL,3871.0,4661.0,5369.0,5308.0,6502.0,...,8668.0,6351.0,9873.0,10570.0,11352.0,12238.0,10545.0,10863.0,9770.0,8071.0
4,394514,4,"Dallas, TX",msa,TX,4496.0,5445.0,6209.0,6465.0,6668.0,...,6240.0,5906.0,7721.0,7364.0,8202.0,8311.0,7609.0,7851.0,6782.0,6505.0

In [8]:
#pulling sales counts for Atlanta
atl_sales_count = sales_count.loc[sales_count['RegionName']=='Atlanta, GA']
atl_sales_count

,RegionID,SizeRank,RegionName,RegionType,StateName,2008-02-29,2008-03-31,2008-04-30,2008-05-31,2008-06-30,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
9,394347,9,"Atlanta, GA",msa,GA,3750.0,4167.0,4572.0,4520.0,4916.0,...,6804.0,6745.0,9597.0,8917.0,9330.0,9344.0,7929.0,7975.0,6915.0,7230.0

In [9]:
#pulling out list price for Atlanta
atl_list_price = list_price.loc[list_price['RegionName']=='Atlanta, GA']
atl_list_price

,RegionID,SizeRank,RegionName,RegionType,StateName,2018-03-31,2018-04-30,2018-05-31,2018-06-30,2018-07-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
9,394347,9,"Atlanta, GA",msa,GA,280600.0,289900.0,296600.0,299633.0,297000.0,...,345633.0,345667.0,351633.0,362633.0,375933.0,387948.0,391915.0,388582.0,381600.0,376600.0

In [10]:
#inventory for Atlanta
atl_inventory = inventory.loc[inventory['RegionName']=='Atlanta, GA']
atl_inventory

,RegionID,SizeRank,RegionName,RegionType,StateName,2018-03-31,2018-04-30,2018-05-31,2018-06-30,2018-07-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
9,394347,9,"Atlanta, GA",msa,GA,25097.0,26357.0,27888.0,29198.0,30516.0,...,16811.0,15848.0,16466.0,17144.0,18526.0,20072.0,21957.0,23546.0,24055.0,23799.0

In [11]:
#Atlanta sales count melt
atl_sales_count = pd.melt(atl_sales_count, id_vars=['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = 'sales_count' )
atl_sales_count.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,date,sales_count
0,394347,9,"Atlanta, GA",msa,GA,2008-02-29,3750.0
1,394347,9,"Atlanta, GA",msa,GA,2008-03-31,4167.0
2,394347,9,"Atlanta, GA",msa,GA,2008-04-30,4572.0
3,394347,9,"Atlanta, GA",msa,GA,2008-05-31,4520.0
4,394347,9,"Atlanta, GA",msa,GA,2008-06-30,4916.0

In [12]:
#converting sales count date to datetime
atl_sales_count['date']= pd.to_datetime(atl_sales_count['date'])
atl_sales_count.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 177 entries, 0 to 176
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   RegionID     177 non-null    int64
 1   SizeRank     177 non-null    int64
 2   RegionName   177 non-null    object
 3   RegionType   177 non-null    object
 4   StateName    177 non-null    object
 5   date         177 non-null    datetime64[ns]
 6   sales_count  177 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(3)
memory usage: 9.8+ KB

In [13]:
#adjusting time to match other dateframes starting at 2018-03-31
atl_sales_count = atl_sales_count.loc[atl_sales_count['date']>='2018-03-31']
atl_sales_count = atl_sales_count.reset_index(drop=True)
atl_sales_count = atl_sales_count.rename(columns = {'RegionName':'City','StateName':'State'})
atl_sales_count.head()

   RegionID  SizeRank         City RegionType State       date  sales_count
0    394347         9  Atlanta, GA        msa    GA 2018-03-31       9093.0
1    394347         9  Atlanta, GA        msa    GA 2018-04-30       9374.0
2    394347         9  Atlanta, GA        msa    GA 2018-05-31      10845.0
3    394347         9  Atlanta, GA        msa    GA 2018-06-30      10787.0
4    394347         9  Atlanta, GA        msa    GA 2018-07-31      10211.0

In [14]:
#Atlanta list price melt
atl_list_price = pd.melt(atl_list_price, id_vars=['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = 'avg_list_price' )
atl_list_price.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,date,avg_list_price
0,394347,9,"Atlanta, GA",msa,GA,2018-03-31,280600.0
1,394347,9,"Atlanta, GA",msa,GA,2018-04-30,289900.0
2,394347,9,"Atlanta, GA",msa,GA,2018-05-31,296600.0
3,394347,9,"Atlanta, GA",msa,GA,2018-06-30,299633.0
4,394347,9,"Atlanta, GA",msa,GA,2018-07-31,297000.0

In [15]:
atl_list_price = atl_list_price.rename(columns = {'RegionName':'City','StateName':'State'})
atl_list_price.head()

,RegionID,SizeRank,City,RegionType,State,date,avg_list_price
0,394347,9,"Atlanta, GA",msa,GA,2018-03-31,280600.0
1,394347,9,"Atlanta, GA",msa,GA,2018-04-30,289900.0
2,394347,9,"Atlanta, GA",msa,GA,2018-05-31,296600.0
3,394347,9,"Atlanta, GA",msa,GA,2018-06-30,299633.0
4,394347,9,"Atlanta, GA",msa,GA,2018-07-31,297000.0

In [16]:
#Atlanta inventory melt
atl_inventory = pd.melt(atl_inventory, id_vars=['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = 'inventory_count' )

In [17]:
atl_inventory = atl_inventory.rename(columns = {'RegionName':'City','StateName':'State'})
atl_inventory.head()

,RegionID,SizeRank,City,RegionType,State,date,inventory_count
0,394347,9,"Atlanta, GA",msa,GA,2018-03-31,25097.0
1,394347,9,"Atlanta, GA",msa,GA,2018-04-30,26357.0
2,394347,9,"Atlanta, GA",msa,GA,2018-05-31,27888.0
3,394347,9,"Atlanta, GA",msa,GA,2018-06-30,29198.0
4,394347,9,"Atlanta, GA",msa,GA,2018-07-31,30516.0

In [18]:
#All sales count melt
sales_count = pd.melt(sales_count, id_vars=['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = 'sales_count' )

In [19]:
sales_count = sales_count.rename(columns = {'RegionName':'City','StateName':'State'})
sales_count.head()

,RegionID,SizeRank,City,RegionType,State,date,sales_count
0,102001,0,United States,country,NaN,2008-02-29,152555.0
1,394913,1,"New York, NY",msa,NY,2008-02-29,7435.0
2,753899,2,"Los Angeles, CA",msa,CA,2008-02-29,3263.0
3,394463,3,"Chicago, IL",msa,IL,2008-02-29,3871.0
4,394514,4,"Dallas, TX",msa,TX,2008-02-29,4496.0

In [20]:
sales_count.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16638 entries, 0 to 16637
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   RegionID     16638 non-null  int64
 1   SizeRank     16638 non-null  int64
 2   City         16638 non-null  object
 3   RegionType   16638 non-null  object
 4   State        16461 non-null  object
 5   date         16638 non-null  object
 6   sales_count  16608 non-null  float64
dtypes: float64(1), int64(2), object(4)
memory usage: 910.0+ KB

In [21]:
#all sales count convert date column to datetime
sales_count['date'] = pd.to_datetime(sales_count['date'])

In [22]:
sales_count.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16638 entries, 0 to 16637
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   RegionID     16638 non-null  int64
 1   SizeRank     16638 non-null  int64
 2   City         16638 non-null  object
 3   RegionType   16638 non-null  object
 4   State        16461 non-null  object
 5   date         16638 non-null  datetime64[ns]
 6   sales_count  16608 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(3)
memory usage: 910.0+ KB

In [23]:
#Start date to match the other dataframes at 2018-03-31
sales_count = sales_count.loc[sales_count['date'] >= '2018-03-31']
sales_count = sales_count.reset_index(drop=True)
sales_count.head()

,RegionID,SizeRank,City,RegionType,State,date,sales_count
0,102001,0,United States,country,NaN,2018-03-31,334707.0
1,394913,1,"New York, NY",msa,NY,2018-03-31,12199.0
2,753899,2,"Los Angeles, CA",msa,CA,2018-03-31,9050.0
3,394463,3,"Chicago, IL",msa,IL,2018-03-31,9051.0
4,394514,4,"Dallas, TX",msa,TX,2018-03-31,7493.0

In [24]:
#all list price melt
list_price = pd.melt(list_price, id_vars=['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = 'avg_list_price' )

In [25]:
list_price = list_price.rename(columns = {'RegionName':'City','StateName':'State'})
list_price.head()

,RegionID,SizeRank,City,RegionType,State,date,avg_list_price
0,102001,0,United States,country,NaN,2018-03-31,263267.0
1,394913,1,"New York, NY",msa,NY,2018-03-31,503000.0
2,753899,2,"Los Angeles, CA",msa,CA,2018-03-31,721333.0
3,394463,3,"Chicago, IL",msa,IL,2018-03-31,284600.0
4,394514,4,"Dallas, TX",msa,TX,2018-03-31,322997.0

In [26]:
#all inventory melt
inventory = pd.melt(inventory, id_vars=['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = 'inventory_count' )

In [27]:
inventory= inventory.rename(columns = {'RegionName':'City','StateName':'State'})
inventory.head()

,RegionID,SizeRank,City,RegionType,State,date,inventory_count
0,102001,0,United States,country,NaN,2018-03-31,1424090.0
1,394913,1,"New York, NY",msa,NY,2018-03-31,73707.0
2,753899,2,"Los Angeles, CA",msa,CA,2018-03-31,21998.0
3,394463,3,"Chicago, IL",msa,IL,2018-03-31,38581.0
4,394514,4,"Dallas, TX",msa,TX,2018-03-31,24043.0

In [28]:
#Nashville sales count table DF
nash_sales_count = sales_count.loc[sales_count['City']== 'Nashville, TN']
nash_sales_count = nash_sales_count.reset_index(drop = True)
nash_sales_count.head()

   RegionID  SizeRank           City RegionType State       date  sales_count
0    394902        36  Nashville, TN        msa    TN 2018-03-31       2760.0
1    394902        36  Nashville, TN        msa    TN 2018-04-30       3104.0
2    394902        36  Nashville, TN        msa    TN 2018-05-31       3441.0
3    394902        36  Nashville, TN        msa    TN 2018-06-30       3503.0
4    394902        36  Nashville, TN        msa    TN 2018-07-31       3353.0

In [29]:
#Nashville list price DF
nash_list_price = list_price.loc[list_price['City']== 'Nashville, TN']
nash_list_price = nash_list_price.reset_index(drop=True)
nash_list_price.head()

,RegionID,SizeRank,City,RegionType,State,date,avg_list_price
0,394902,36,"Nashville, TN",msa,TN,2018-03-31,327633.0
1,394902,36,"Nashville, TN",msa,TN,2018-04-30,332933.0
2,394902,36,"Nashville, TN",msa,TN,2018-05-31,334933.0
3,394902,36,"Nashville, TN",msa,TN,2018-06-30,336600.0
4,394902,36,"Nashville, TN",msa,TN,2018-07-31,333267.0

In [30]:
#Nashville inventory DF
nash_inventory = inventory.loc[inventory['City']=='Nashville, TN']
nash_inventory = nash_inventory.reset_index(drop=True)
nash_inventory.head()

,RegionID,SizeRank,City,RegionType,State,date,inventory_count
0,394902,36,"Nashville, TN",msa,TN,2018-03-31,6837.0
1,394902,36,"Nashville, TN",msa,TN,2018-04-30,7421.0
2,394902,36,"Nashville, TN",msa,TN,2018-05-31,8141.0
3,394902,36,"Nashville, TN",msa,TN,2018-06-30,8739.0
4,394902,36,"Nashville, TN",msa,TN,2018-07-31,9184.0

In [31]:
austin_sales_count = sales_count.loc[sales_count['City']=='Austin, TX']
austin_sales_count = austin_sales_count.reset_index(drop=True)
austin_sales_count.head()

   RegionID  SizeRank        City RegionType State       date  sales_count
0    394355        29  Austin, TX        msa    TX 2018-03-31       2297.0
1    394355        29  Austin, TX        msa    TX 2018-04-30       2449.0
2    394355        29  Austin, TX        msa    TX 2018-05-31       2969.0
3    394355        29  Austin, TX        msa    TX 2018-06-30       3019.0
4    394355        29  Austin, TX        msa    TX 2018-07-31       2958.0

In [32]:
austin_list_price = list_price.loc[list_price['City']=='Austin, TX']
austin_list_price = austin_list_price.reset_index(drop=True)
austin_list_price.head()

   RegionID  SizeRank        City RegionType State        date  avg_list_price
0    394355        29  Austin, TX        msa    TX  2018-03-31        362567.0
1    394355        29  Austin, TX        msa    TX  2018-04-30        367600.0
2    394355        29  Austin, TX        msa    TX  2018-05-31        370717.0
3    394355        29  Austin, TX        msa    TX  2018-06-30        372084.0
4    394355        29  Austin, TX        msa    TX  2018-07-31        371751.0

In [33]:
austin_inventory = inventory.loc[inventory['City']=='Austin, TX']
austin_inventory = austin_inventory.reset_index(drop=True)
austin_inventory.head()

,RegionID,SizeRank,City,RegionType,State,date,inventory_count
0,394355,29,"Austin, TX",msa,TX,2018-03-31,7392.0
1,394355,29,"Austin, TX",msa,TX,2018-04-30,8277.0
2,394355,29,"Austin, TX",msa,TX,2018-05-31,9243.0
3,394355,29,"Austin, TX",msa,TX,2018-06-30,9920.0
4,394355,29,"Austin, TX",msa,TX,2018-07-31,10287.0

In [34]:
#forecasting csv
forecast = pd.read_csv('../data/zillow_forecasts.csv')

In [35]:
forecast.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,BaseDate,2022-11-30,2023-01-31,2023-10-31
0,102001,0,United States,country,NaN,2022-10-31,0.2,0.4,1.2
1,394913,1,"New York, NY",msa,NY,2022-10-31,0.1,-0.1,-1.4
2,753899,2,"Los Angeles, CA",msa,CA,2022-10-31,-0.1,-0.8,-1.8
3,394463,3,"Chicago, IL",msa,IL,2022-10-31,0.3,0.3,-1.4
4,394514,4,"Dallas, TX",msa,TX,2022-10-31,0.3,0.6,2.2

In [36]:
#dropping irrelevant date
forecast = forecast.drop('2022-11-30', axis=1)
forecast.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,BaseDate,2023-01-31,2023-10-31
0,102001,0,United States,country,NaN,2022-10-31,0.4,1.2
1,394913,1,"New York, NY",msa,NY,2022-10-31,-0.1,-1.4
2,753899,2,"Los Angeles, CA",msa,CA,2022-10-31,-0.8,-1.8
3,394463,3,"Chicago, IL",msa,IL,2022-10-31,0.3,-1.4
4,394514,4,"Dallas, TX",msa,TX,2022-10-31,0.6,2.2

In [37]:
#forecast melt
forecast = pd.melt(forecast, id_vars = ['RegionID','SizeRank','RegionName','RegionType','StateName', 'BaseDate'], var_name = 'proj_date', value_name = 'proj_value')

In [38]:
forecast = forecast.rename(columns = {'RegionName':'City','StateName':'State'})
forecast.head()

,RegionID,SizeRank,City,RegionType,State,BaseDate,proj_date,proj_value
0,102001,0,United States,country,NaN,2022-10-31,2023-01-31,0.4
1,394913,1,"New York, NY",msa,NY,2022-10-31,2023-01-31,-0.1
2,753899,2,"Los Angeles, CA",msa,CA,2022-10-31,2023-01-31,-0.8
3,394463,3,"Chicago, IL",msa,IL,2022-10-31,2023-01-31,0.3
4,394514,4,"Dallas, TX",msa,TX,2022-10-31,2023-01-31,0.6

In [39]:
#Atlanta forecast
atl_forecast = forecast.loc[forecast['City']=='Atlanta, GA']
atl_forecast = atl_forecast.reset_index(drop=True)
atl_forecast

,RegionID,SizeRank,City,RegionType,State,BaseDate,proj_date,proj_value
0,394347,9,"Atlanta, GA",msa,GA,2022-10-31,2023-01-31,-0.1
1,394347,9,"Atlanta, GA",msa,GA,2022-10-31,2023-10-31,2.6

In [40]:
#Nashville forecast
nash_forecast = forecast.loc[forecast['City']=='Nashville, TN']
nash_forecast = nash_forecast.reset_index(drop=True)
nash_forecast

,RegionID,SizeRank,City,RegionType,State,BaseDate,proj_date,proj_value
0,394902,36,"Nashville, TN",msa,TN,2022-10-31,2023-01-31,-0.7
1,394902,36,"Nashville, TN",msa,TN,2022-10-31,2023-10-31,1.3

In [41]:
#Austin forecast
austin_forecast = forecast.loc[forecast['City']=='Austin, TX']
austin_forecast = austin_forecast.reset_index(drop=True)
austin_forecast

,RegionID,SizeRank,City,RegionType,State,BaseDate,proj_date,proj_value
0,394355,29,"Austin, TX",msa,TX,2022-10-31,2023-01-31,-2.7
1,394355,29,"Austin, TX",msa,TX,2022-10-31,2023-10-31,-0.4

In [42]:
#one bedroom value DF
one_bed_value = pd.read_csv('../data/one_bedroom_value.csv')
one_bed_value.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2000-01-31,2000-02-29,2000-03-31,2000-04-30,2000-05-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
0,102001,0,United States,country,NaN,85081.0,85364.0,85673.0,86303.0,86925.0,...,230766.0,234229.0,237816.0,241563.0,245093.0,248123.0,250154.0,251278.0,251887.0,252472.0
1,394913,1,"New York, NY",msa,NY,160659.0,161685.0,162526.0,164236.0,165873.0,...,432570.0,434887.0,438854.0,443229.0,447675.0,451303.0,454315.0,456246.0,457128.0,457673.0
2,753899,2,"Los Angeles, CA",msa,CA,134285.0,134850.0,135697.0,137275.0,138974.0,...,515782.0,521743.0,530541.0,539905.0,548374.0,549021.0,548602.0,541662.0,537058.0,531931.0
3,394463,3,"Chicago, IL",msa,IL,110652.0,110920.0,111443.0,112441.0,113578.0,...,183172.0,184089.0,185392.0,186510.0,188089.0,189455.0,190474.0,190836.0,191213.0,191646.0
4,394514,4,"Dallas, TX",msa,TX,76498.0,76688.0,76268.0,75856.0,75731.0,...,169588.0,172874.0,175890.0,180084.0,183450.0,186817.0,187776.0,188265.0,185284.0,182623.0

In [43]:
#two bedroom value DF
two_bed_value = pd.read_csv('../data/two_bedroom_value.csv')
two_bed_value.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2000-01-31,2000-02-29,2000-03-31,2000-04-30,2000-05-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
0,102001,0,United States,country,NaN,93964.0,94226.0,94500.0,95064.0,95631.0,...,243911.0,247843.0,251923.0,256190.0,260130.0,263433.0,265497.0,266606.0,267184.0,267821.0
1,394913,1,"New York, NY",msa,NY,161936.0,162774.0,163480.0,164947.0,166399.0,...,401540.0,405145.0,409802.0,414772.0,419988.0,424506.0,428245.0,430330.0,431353.0,431933.0
2,753899,2,"Los Angeles, CA",msa,CA,179927.0,180419.0,181331.0,183050.0,184982.0,...,685711.0,694066.0,706878.0,721499.0,734273.0,735225.0,733400.0,722761.0,715473.0,708287.0
3,394463,3,"Chicago, IL",msa,IL,126267.0,126506.0,126897.0,127632.0,128390.0,...,219278.0,221225.0,223701.0,226319.0,229397.0,231765.0,233264.0,233609.0,233985.0,234542.0
4,394514,4,"Dallas, TX",msa,TX,84480.0,84533.0,84507.0,84601.0,84732.0,...,224550.0,229765.0,234886.0,240547.0,245437.0,249785.0,251000.0,250994.0,248714.0,248115.0

In [44]:
#three bedroom value DF
three_bed_value = pd.read_csv('../data/three_bedroom_value.csv')
three_bed_value.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2000-01-31,2000-02-29,2000-03-31,2000-04-30,2000-05-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
0,102001,0,United States,country,NaN,118923.0,119230.0,119548.0,120197.0,120850.0,...,301711.0,306563.0,311466.0,316596.0,321247.0,325119.0,327368.0,328391.0,328772.0,329286.0
1,394913,1,"New York, NY",msa,NY,200153.0,201312.0,202366.0,204453.0,206416.0,...,518847.0,523541.0,529764.0,536306.0,543203.0,548843.0,553294.0,555372.0,556365.0,556637.0
2,753899,2,"Los Angeles, CA",msa,CA,218383.0,219075.0,220219.0,222371.0,224740.0,...,839317.0,851164.0,867833.0,886248.0,901837.0,902755.0,898995.0,884803.0,874767.0,865216.0
3,394463,3,"Chicago, IL",msa,IL,145931.0,146223.0,146647.0,147497.0,148429.0,...,276234.0,278725.0,281889.0,285094.0,288827.0,291584.0,293239.0,293399.0,293598.0,294102.0
4,394514,4,"Dallas, TX",msa,TX,106565.0,106661.0,106739.0,106924.0,107101.0,...,299966.0,307338.0,314456.0,322623.0,329960.0,336265.0,338228.0,337463.0,335881.0,335789.0

In [45]:
#four bedroom value DF
four_bed_value = pd.read_csv('../data/four_bedroom_value.csv')
four_bed_value.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2000-01-31,2000-02-29,2000-03-31,2000-04-30,2000-05-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
0,102001,0,United States,country,NaN,175564.0,176088.0,176634.0,177753.0,178880.0,...,449105.0,456154.0,463525.0,471342.0,478417.0,483924.0,486675.0,487274.0,487157.0,487422.0
1,394913,1,"New York, NY",msa,NY,267636.0,269292.0,270702.0,273614.0,276373.0,...,655065.0,660909.0,668790.0,677547.0,686730.0,694244.0,699824.0,702639.0,703937.0,704305.0
2,753899,2,"Los Angeles, CA",msa,CA,288298.0,289616.0,291170.0,294224.0,297293.0,...,1060530.0,1078578.0,1102929.0,1128559.0,1151427.0,1154801.0,1151241.0,1134622.0,1124317.0,1114248.0
3,394463,3,"Chicago, IL",msa,IL,215112.0,215684.0,216449.0,217892.0,219406.0,...,389249.0,392701.0,397318.0,402475.0,408150.0,412431.0,415056.0,415679.0,416203.0,417270.0
4,394514,4,"Dallas, TX",msa,TX,182888.0,182867.0,182957.0,183113.0,183300.0,...,453748.0,464726.0,474913.0,487500.0,499494.0,509816.0,512248.0,510433.0,508292.0,509150.0

In [46]:
#five bedroom value DF
five_bed_value = pd.read_csv('../data/five_bedroom_value.csv')
five_bed_value.head()

,RegionID,SizeRank,RegionName,RegionType,StateName,2000-01-31,2000-02-29,2000-03-31,2000-04-30,2000-05-31,...,2022-01-31,2022-02-28,2022-03-31,2022-04-30,2022-05-31,2022-06-30,2022-07-31,2022-08-31,2022-09-30,2022-10-31
0,102001,0,United States,country,NaN,240204.0,241054.0,241899.0,243643.0,245420.0,...,637146.0,647483.0,658266.0,669830.0,680131.0,687627.0,690893.0,690941.0,690356.0,690381.0
1,394913,1,"New York, NY",msa,NY,374215.0,376628.0,378716.0,382870.0,386888.0,...,946714.0,955671.0,968114.0,981890.0,996539.0,1008883.0,1018603.0,1024546.0,1027954.0,1029592.0
2,753899,2,"Los Angeles, CA",msa,CA,454793.0,456796.0,459254.0,463957.0,468684.0,...,1582139.0,1609125.0,1645105.0,1683993.0,1719042.0,1726076.0,1724951.0,1705679.0,1695555.0,1680989.0
3,394463,3,"Chicago, IL",msa,IL,302287.0,303048.0,304151.0,306305.0,308488.0,...,526275.0,530721.0,536629.0,543510.0,551382.0,557830.0,562530.0,564526.0,566102.0,568069.0
4,394514,4,"Dallas, TX",msa,TX,277644.0,277490.0,277634.0,277886.0,278258.0,...,655932.0,672622.0,687495.0,706494.0,724860.0,740863.0,743991.0,741058.0,737802.0,739440.0

In [47]:
#one bed melt
one_bed_value = pd.melt(one_bed_value, id_vars = ['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = 'home_value')

In [48]:
#two bed melt
two_bed_value = pd.melt(two_bed_value, id_vars = ['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = '2br_value')

In [49]:
#three bed melt
three_bed_value = pd.melt(three_bed_value, id_vars = ['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = '3br_value')

In [50]:
#four bed melt
four_bed_value = pd.melt(four_bed_value, id_vars = ['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = '4br_value')

In [51]:
#five bed melt
five_bed_value = pd.melt(five_bed_value, id_vars = ['RegionID','SizeRank','RegionName','RegionType','StateName'], var_name = 'date', value_name = '5br_value')

In [52]:
intentional error

SyntaxError: invalid syntax (3626927063.py, line 1)

In [107]:
#household income 2017
hh_nash_inc_2017 = pd.read_csv('../data/nash_mean_inc_2017.csv',header = [1])
hh_nash_inc_2017.head()

,HOUSEHOLD INCOME,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,All households,"717,370","Â±5,392","717,370","Â±5,392","87,562","Â±1,684"
1,With earnings,"599,025","Â±6,676",83.5%,Â±0.6,"86,767","Â±1,634"
2,With wages or salary income,"574,478","Â±6,882",80.1%,Â±0.7,"83,392","Â±1,509"
3,With self-employment income,"98,156","Â±4,836",13.7%,Â±0.7,"41,452","Â±4,228"
4,"With interest, dividends, or net rental in...","139,715","Â±5,140",19.5%,Â±0.7,"22,588","Â±3,422"

In [110]:
#household income 2018
hh_nash_inc_2018 = pd.read_csv('../data/nash_mean_inc_2018.csv', header=[1])
hh_nash_inc_2018.head()

,HOUSEHOLD INCOME,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,All households,"730,709","Â±5,127","730,709","Â±5,127","89,756","Â±1,606"
1,With earnings,"607,942","Â±6,318",83.2%,Â±0.6,"89,299","Â±1,814"
2,With wages or salary income,"582,962","Â±6,694",79.8%,Â±0.6,"86,373","Â±1,740"
3,With self-employment income,"99,658","Â±5,580",13.6%,Â±0.8,"39,502","Â±3,175"
4,"With interest, dividends, or net renta...","138,542","Â±4,610",19.0%,Â±0.6,"24,118","Â±3,110"

In [111]:
#household income 2019
hh_nash_inc_2019 = pd.read_csv('../data/nash_mean_inc_2019.csv',header = [1])
hh_nash_inc_2019.head()

,HOUSEHOLD INCOME,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,All households,"733,787","Â±6,057","733,787","Â±6,057","96,579","Â±1,950"
1,With earnings,"612,235","Â±6,381",83.4%,Â±0.5,"95,826","Â±2,134"
2,With wages or salary income,"587,726","Â±6,861",80.1%,Â±0.6,"92,290","Â±2,097"
3,With self-employment income,"104,892","Â±6,143",14.3%,Â±0.8,"42,198","Â±3,587"
4,"With interest, dividends, or net renta...","141,008","Â±5,414",19.2%,Â±0.8,"23,256","Â±3,267"

In [112]:
#household income 2020
hh_nash_inc_2020 = pd.read_csv('../data/nashville_mean_inc_2020.csv',header=[1])
hh_nash_inc_2020.head()

,HOUSEHOLD INCOME,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,All households,"279,173","Â±1,418","279,173","Â±1,418","86,197","Â±1,352","727,452","Â±2,190","727,452","Â±2,190","93,607","Â±1,030"
1,With earnings,"236,159","Â±1,806",84.6%,Â±0.4,"85,613","Â±1,455","604,501","Â±2,973",83.1%,Â±0.3,"93,082","Â±1,121"
2,With wages or salary income,"226,550","Â±1,931",81.2%,Â±0.5,"82,293","Â±1,248","581,017","Â±3,131",79.9%,Â±0.3,"89,157",Â±974
3,With self-employment income,"36,028","Â±1,297",12.9%,Â±0.4,"43,711","Â±4,404","97,229","Â±2,570",13.4%,Â±0.3,"45,939","Â±2,784"
4,"With interest, dividends, or net renta...","50,026","Â±1,683",17.9%,Â±0.6,"22,294","Â±2,539","139,246","Â±2,397",19.1%,Â±0.3,"23,700","Â±1,857"

In [113]:
#household income 2021
hh_nash_inc_2021 = pd.read_csv('../data/nash_mean_inc_2021.csv', header=[1])
hh_nash_inc_2021.head()

,HOUSEHOLD INCOME,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,All households,"305,247","Â±3,646","305,247","Â±3,646","95,481","Â±3,743","794,373","Â±5,724","794,373","Â±5,724","102,346","Â±2,558"
1,With earnings,"255,109","Â±4,899",83.6%,Â±1.1,"96,392","Â±4,011","656,660","Â±7,491",82.7%,Â±0.7,"101,546","Â±2,819"
2,With wages or salary income,"244,527","Â±4,854",80.1%,Â±1.1,"91,592","Â±3,460","630,149","Â±7,454",79.3%,Â±0.7,"96,682","Â±2,476"
3,With self-employment income,"42,963","Â±3,731",14.1%,Â±1.2,"51,060","Â±9,706","111,321","Â±6,326",14.0%,Â±0.8,"51,720","Â±5,404"
4,"With interest, dividends, or net renta...","54,550","Â±4,198",17.9%,Â±1.4,"22,731","Â±5,339","152,831","Â±6,860",19.2%,Â±0.9,"26,621","Â±3,968"

In [108]:
#pulling out relevant columns
hh_nash_inc_2017 = hh_nash_inc_2017.loc[:,['HOUSEHOLD INCOME','Unnamed: 1','Unnamed: 5']]

#renaming column
hh_nash_inc_2017 = hh_nash_inc_2017.rename(columns = {'HOUSEHOLD INCOME':'household_income','Unnamed: 1': 'household_count',
                                                      'Unnamed: 5':'avg_income'})

#stripping extra space in column
hh_nash_inc_2017['household_income'] = hh_nash_inc_2017['household_income'].str.strip()

#consolidating table
hh_nash_inc_2017 = hh_nash_inc_2017.loc[(hh_nash_inc_2017['household_income']=='All households')|
                                        (hh_nash_inc_2017['household_income']=='With earnings')|
                                        (hh_nash_inc_2017['household_income']=='With wages or salary income')|
                                        (hh_nash_inc_2017['household_income']=='With self-employment income')]

#add year column
hh_nash_inc_2017['year'] = 2017

#reorder columns 
hh_nash_inc_2017 = hh_nash_inc_2017.loc[:,['household_income', 'year','household_count','avg_income']]

hh_nash_inc_2017.head()

              household_income  year household_count avg_income
0               All households  2017         717,370     87,562
1                With earnings  2017         599,025     86,767
2  With wages or salary income  2017         574,478     83,392
3  With self-employment income  2017          98,156     41,452

In [114]:
#pulling out relevant columns
hh_nash_inc_2018 = hh_nash_inc_2018.loc[:,['HOUSEHOLD INCOME','Unnamed: 1','Unnamed: 5']]

#renaming column
hh_nash_inc_2018 = hh_nash_inc_2018.rename(columns = {'HOUSEHOLD INCOME':'household_income','Unnamed: 1': 'household_count',
                                                      'Unnamed: 5':'avg_income'})

#stripping extra space in column
hh_nash_inc_2018['household_income'] = hh_nash_inc_2018['household_income'].str.strip()

#consolidating table
hh_nash_inc_2018 = hh_nash_inc_2018.loc[(hh_nash_inc_2018['household_income']=='All households')|
                                        (hh_nash_inc_2018['household_income']=='With earnings')|
                                        (hh_nash_inc_2018['household_income']=='With wages or salary income')|
                                        (hh_nash_inc_2018['household_income']=='With self-employment income')]

#add year column
hh_nash_inc_2018['year'] = 2018

#reorder columns 
hh_nash_inc_2018 = hh_nash_inc_2018.loc[:,['household_income', 'year','household_count','avg_income']]

hh_nash_inc_2018.head()

              household_income  year household_count avg_income
0               All households  2018         730,709     89,756
1                With earnings  2018         607,942     89,299
2  With wages or salary income  2018         582,962     86,373
3  With self-employment income  2018          99,658     39,502

In [115]:
#pulling out relevant columns
hh_nash_inc_2019 = hh_nash_inc_2019.loc[:,['HOUSEHOLD INCOME','Unnamed: 1','Unnamed: 5']]

#renaming column
hh_nash_inc_2019 = hh_nash_inc_2019.rename(columns = {'HOUSEHOLD INCOME':'household_income','Unnamed: 1': 'household_count',
                                                      'Unnamed: 5':'avg_income'})

#stripping extra space in column
hh_nash_inc_2019['household_income'] = hh_nash_inc_2019['household_income'].str.strip()

#consolidating table
hh_nash_inc_2019 = hh_nash_inc_2019.loc[(hh_nash_inc_2019['household_income']=='All households')|
                                        (hh_nash_inc_2019['household_income']=='With earnings')|
                                        (hh_nash_inc_2019['household_income']=='With wages or salary income')|
                                        (hh_nash_inc_2019['household_income']=='With self-employment income')]

#add year column
hh_nash_inc_2019['year'] = 2019

#reorder columns 
hh_nash_inc_2019 = hh_nash_inc_2019.loc[:,['household_income', 'year','household_count','avg_income']]

hh_nash_inc_2019.head()

              household_income  year household_count avg_income
0               All households  2019         733,787     96,579
1                With earnings  2019         612,235     95,826
2  With wages or salary income  2019         587,726     92,290
3  With self-employment income  2019         104,892     42,198

In [116]:
#pulling out relevant columns
hh_nash_inc_2020 = hh_nash_inc_2020.loc[:,['HOUSEHOLD INCOME','Unnamed: 1','Unnamed: 5']]

#renaming column
hh_nash_inc_2020 = hh_nash_inc_2020.rename(columns = {'HOUSEHOLD INCOME':'household_income','Unnamed: 1': 'household_count',
                                                      'Unnamed: 5':'avg_income'})

#stripping extra space in column
hh_nash_inc_2020['household_income'] = hh_nash_inc_2020['household_income'].str.strip()

#consolidating table
hh_nash_inc_2020 = hh_nash_inc_2020.loc[(hh_nash_inc_2020['household_income']=='All households')|
                                        (hh_nash_inc_2020['household_income']=='With earnings')|
                                        (hh_nash_inc_2020['household_income']=='With wages or salary income')|
                                        (hh_nash_inc_2020['household_income']=='With self-employment income')]

#add year column
hh_nash_inc_2020['year'] = 2020

#reorder columns 
hh_nash_inc_2020 = hh_nash_inc_2020.loc[:,['household_income', 'year','household_count','avg_income']]

hh_nash_inc_2020.head()

              household_income  year household_count avg_income
0               All households  2020         279,173     86,197
1                With earnings  2020         236,159     85,613
2  With wages or salary income  2020         226,550     82,293
3  With self-employment income  2020          36,028     43,711

In [117]:
#pulling out relevant columns
hh_nash_inc_2021 = hh_nash_inc_2021.loc[:,['HOUSEHOLD INCOME','Unnamed: 1','Unnamed: 5']]

#renaming column
hh_nash_inc_2021 = hh_nash_inc_2021.rename(columns = {'HOUSEHOLD INCOME':'household_income','Unnamed: 1': 'household_count',
                                                      'Unnamed: 5':'avg_income'})

#stripping extra space in column
hh_nash_inc_2021['household_income'] = hh_nash_inc_2021['household_income'].str.strip()

#consolidating table
hh_nash_inc_2021 = hh_nash_inc_2021.loc[(hh_nash_inc_2021['household_income']=='All households')|
                                        (hh_nash_inc_2021['household_income']=='With earnings')|
                                        (hh_nash_inc_2021['household_income']=='With wages or salary income')|
                                        (hh_nash_inc_2021['household_income']=='With self-employment income')]

#add year column
hh_nash_inc_2021['year'] = 2021

#reorder columns 
hh_nash_inc_2021 = hh_nash_inc_2021.loc[:,['household_income', 'year','household_count','avg_income']]

hh_nash_inc_2021.head()

              household_income  year household_count avg_income
0               All households  2021         305,247     95,481
1                With earnings  2021         255,109     96,392
2  With wages or salary income  2021         244,527     91,592
3  With self-employment income  2021          42,963     51,060

In [126]:
#family income 2017
fs_nash_inc_2017 = pd.read_csv('../data/nash_mean_inc_2017.csv',header = [13])
fs_nash_inc_2017.head()

,FAMILY INCOME BY NUMBER OF WORKERS IN FAMILY,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,All families,"483,336","Â±7,708","483,336","Â±7,708","101,349","Â±2,243"
1,No workers,"56,150","Â±2,870",11.6%,Â±0.6,"52,417","Â±3,547"
2,1 worker,"151,727","Â±6,758",31.4%,Â±1.2,"83,538","Â±4,320"
3,"2 workers, husband and wife worked","172,248","Â±6,841",35.6%,Â±1.3,"125,667","Â±3,608"
4,"2 workers, other","46,896","Â±3,846",9.7%,Â±0.8,"88,443","Â±6,373"

In [119]:
#family income 2017
fs_nash_inc_2018 = pd.read_csv('../data/nash_mean_inc_2018.csv',header = [13])
fs_nash_inc_2018.head()

,FAMILY INCOME BY NUMBER OF WORKERS IN FAMILY,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,All families,"483,969","Â±6,017","483,969","Â±6,017","103,564","Â±2,164"
1,No workers,"55,514","Â±3,345",11.5%,Â±0.7,"52,739","Â±3,660"
2,1 worker,"156,000","Â±6,092",32.2%,Â±1.1,"86,731","Â±4,679"
3,"2 workers, husband and wife worked","168,823","Â±5,407",34.9%,Â±1.1,"128,013","Â±3,503"
4,"2 workers, other","48,055","Â±3,542",9.9%,Â±0.7,"88,176","Â±8,372"

In [120]:
#family income 2017
fs_nash_inc_2019 = pd.read_csv('../data/nash_mean_inc_2019.csv',header = [13])
fs_nash_inc_2019.head()

,FAMILY INCOME BY NUMBER OF WORKERS IN FAMILY,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,All families,"479,273","Â±8,224","479,273","Â±8,224","114,503","Â±2,738"
1,No workers,"52,886","Â±2,909",11.0%,Â±0.6,"68,663","Â±5,811"
2,1 worker,"146,837","Â±7,223",30.6%,Â±1.4,"92,423","Â±4,296"
3,"2 workers, both spouses worked","180,040","Â±6,403",37.6%,Â±1.2,"141,105","Â±5,523"
4,"2 workers, other","45,659","Â±3,248",9.5%,Â±0.7,"97,308","Â±8,188"

In [121]:
#family income 2017
fs_nash_inc_2020 = pd.read_csv('../data/nashville_mean_inc_2020.csv',header = [13])
fs_nash_inc_2020.head()

,FAMILY INCOME BY NUMBER OF WORKERS IN FAMILY,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,All families,"150,277","Â±2,438","150,277","Â±2,438","102,601","Â±2,027","478,368","Â±3,479","478,368","Â±3,479","109,167","Â±1,434"
1,No workers,"14,719",Â±830,9.8%,Â±0.5,"54,572","Â±4,274","53,433","Â±1,537",11.2%,Â±0.3,"59,626","Â±2,958"
2,1 worker,"47,400","Â±1,806",31.5%,Â±1.0,"74,830","Â±3,224","148,931","Â±2,797",31.1%,Â±0.5,"88,860","Â±2,347"
3,"2 workers, both spouses worked","54,286","Â±1,905",36.1%,Â±1.1,"140,553","Â±4,182","174,273","Â±3,345",36.4%,Â±0.6,"135,040","Â±2,121"
4,"2 workers, other","17,941","Â±1,202",11.9%,Â±0.8,"79,738","Â±4,951","47,505","Â±1,826",9.9%,Â±0.4,"91,748","Â±3,688"

In [122]:
#family income 2017
fs_nash_inc_2021 = pd.read_csv('../data/nash_mean_inc_2021.csv',header = [13])
fs_nash_inc_2021.head()

,FAMILY INCOME BY NUMBER OF WORKERS IN FAMILY,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,All families,"158,800","Â±5,518","158,800","Â±5,518","115,121","Â±5,138","509,376","Â±8,111","509,376","Â±8,111","120,412","Â±3,551"
1,No workers,"18,818","Â±2,323",11.9%,Â±1.4,"61,517","Â±10,349","63,327","Â±3,906",12.4%,Â±0.8,"65,631","Â±4,924"
2,1 worker,"52,561","Â±3,826",33.1%,Â±2.4,"84,626","Â±8,031","155,907","Â±6,293",30.6%,Â±1.2,"97,190","Â±5,322"
3,"2 workers, both spouses worked","54,439","Â±3,987",34.3%,Â±2.1,"158,098","Â±9,918","186,350","Â±6,909",36.6%,Â±1.1,"147,870","Â±3,830"
4,"2 workers, other","18,748","Â±2,658",11.8%,Â±1.6,"94,993","Â±13,791","48,744","Â±4,448",9.6%,Â±0.8,"113,143","Â±20,708"

In [123]:
fs_nash_inc_2017.columns

Index(['FAMILY INCOME BY NUMBER OF WORKERS IN FAMILY', 'Unnamed: 1',
       'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6'],
      dtype='object')

In [127]:
#pulling out relevant columns
fs_nash_inc_2017 = fs_nash_inc_2017.loc[:,['FAMILY INCOME BY NUMBER OF WORKERS IN FAMILY','Unnamed: 1','Unnamed: 5']]

#renaming column
fs_nash_inc_2017 = fs_nash_inc_2017.rename(columns = {'FAMILY INCOME BY NUMBER OF WORKERS IN FAMILY':'family_size',
                                                      'Unnamed: 1': 'household_count',
                                                      'Unnamed: 5':'avg_income'})

#stripping extra space in column
fs_nash_inc_2017['family_size'] = fs_nash_inc_2017['family_size'].str.strip()

#consolidating table
fs_nash_inc_2017 = fs_nash_inc_2017.loc[(fs_nash_inc_2017['family_size']=='1 worker')|
                                        (fs_nash_inc_2017['family_size']=='2 workers, husband and wife worked')|
                                        (fs_nash_inc_2017['family_size']=='2 workers, other')|
                                        (fs_nash_inc_2017['family_size']=='3 or more workers, husband and wife worked')|
                                        (fs_nash_inc_2017['family_size']=='3 or more workers, other')].reset_index(drop=True)

#add year column
fs_nash_inc_2017['year'] = 2017

#reorder columns 
fs_nash_inc_2017 = fs_nash_inc_2017.loc[:,['family_size', 'year','household_count','avg_income']]

fs_nash_inc_2017.head()

                                  family_size  year household_count avg_income
0                                    1 worker  2017         151,727     83,538
1          2 workers, husband and wife worked  2017         172,248    125,667
2                            2 workers, other  2017          46,896     88,443
3  3 or more workers, husband and wife worked  2017          44,281    144,408
4                    3 or more workers, other  2017          12,034     97,999

In [128]:
#pulling out relevant columns
fs_nash_inc_2018 = fs_nash_inc_2018.loc[:,['FAMILY INCOME BY NUMBER OF WORKERS IN FAMILY','Unnamed: 1','Unnamed: 5']]

#renaming column
fs_nash_inc_2018 = fs_nash_inc_2018.rename(columns = {'FAMILY INCOME BY NUMBER OF WORKERS IN FAMILY':'family_size',
                                                      'Unnamed: 1': 'household_count',
                                                      'Unnamed: 5':'avg_income'})

#stripping extra space in column
fs_nash_inc_2018['family_size'] = fs_nash_inc_2018['family_size'].str.strip()

#consolidating table
fs_nash_inc_2018 = fs_nash_inc_2018.loc[(fs_nash_inc_2018['family_size']=='1 worker')|
                                        (fs_nash_inc_2018['family_size']=='2 workers, husband and wife worked')|
                                        (fs_nash_inc_2018['family_size']=='2 workers, other')|
                                        (fs_nash_inc_2018['family_size']=='3 or more workers, husband and wife worked')|
                                        (fs_nash_inc_2018['family_size']=='3 or more workers, other')].reset_index(drop=True)

#add year column
fs_nash_inc_2018['year'] = 2018

#reorder columns 
fs_nash_inc_2018 = fs_nash_inc_2018.loc[:,['family_size', 'year','household_count','avg_income']]

fs_nash_inc_2018.head()

                                  family_size  year household_count avg_income
0                                    1 worker  2018         156,000     86,731
1          2 workers, husband and wife worked  2018         168,823    128,013
2                            2 workers, other  2018          48,055     88,176
3  3 or more workers, husband and wife worked  2018          43,306    149,296
4                    3 or more workers, other  2018          12,271    109,976

In [130]:
#pulling out relevant columns
fs_nash_inc_2019 = fs_nash_inc_2019.loc[:,['FAMILY INCOME BY NUMBER OF WORKERS IN FAMILY','Unnamed: 1','Unnamed: 5']]

#renaming column
fs_nash_inc_2019 = fs_nash_inc_2019.rename(columns = {'FAMILY INCOME BY NUMBER OF WORKERS IN FAMILY':'family_size',
                                                      'Unnamed: 1': 'household_count',
                                                      'Unnamed: 5':'avg_income'})

#stripping extra space in column
fs_nash_inc_2019['family_size'] = fs_nash_inc_2019['family_size'].str.strip()

#consolidating table
fs_nash_inc_2019 = fs_nash_inc_2019.loc[(fs_nash_inc_2019['family_size']=='1 worker')|
                                        (fs_nash_inc_2019['family_size']=='2 workers, husband and wife worked')|
                                        (fs_nash_inc_2019['family_size']=='2 workers, other')|
                                        (fs_nash_inc_2019['family_size']=='3 or more workers, husband and wife worked')|
                                        (fs_nash_inc_2019['family_size']=='3 or more workers, other')].reset_index(drop= True)

#add year column
fs_nash_inc_2019['year'] = 2019

#reorder columns 
fs_nash_inc_2019 = fs_nash_inc_2019.loc[:,['family_size', 'year','household_count','avg_income']]

fs_nash_inc_2019.head()

                family_size  year household_count avg_income
0                  1 worker  2019         146,837     92,423
1          2 workers, other  2019          45,659     97,308
2  3 or more workers, other  2019          12,950    116,931

In [131]:
#pulling out relevant columns
fs_nash_inc_2020 = fs_nash_inc_2020.loc[:,['FAMILY INCOME BY NUMBER OF WORKERS IN FAMILY','Unnamed: 1','Unnamed: 5']]

#renaming column
fs_nash_inc_2020 = fs_nash_inc_2020.rename(columns = {'FAMILY INCOME BY NUMBER OF WORKERS IN FAMILY':'family_size',
                                                      'Unnamed: 1': 'household_count',
                                                      'Unnamed: 5':'avg_income'})

#stripping extra space in column
fs_nash_inc_2020['family_size'] = fs_nash_inc_2020['family_size'].str.strip()

#consolidating table
fs_nash_inc_2020 = fs_nash_inc_2020.loc[(fs_nash_inc_2020['family_size']=='1 worker')|
                                        (fs_nash_inc_2020['family_size']=='2 workers, husband and wife worked')|
                                        (fs_nash_inc_2020['family_size']=='2 workers, other')|
                                        (fs_nash_inc_2020['family_size']=='3 or more workers, husband and wife worked')|
                                        (fs_nash_inc_2020['family_size']=='3 or more workers, other')].reset_index(drop=True)

#add year column
fs_nash_inc_2020['year'] = 2020

#reorder columns 
fs_nash_inc_2020 = fs_nash_inc_2020.loc[:,['family_size', 'year','household_count','avg_income']]

fs_nash_inc_2020.head()

                family_size  year household_count avg_income
0                  1 worker  2020          47,400     74,830
1          2 workers, other  2020          17,941     79,738
2  3 or more workers, other  2020           4,810     99,018

In [132]:
#pulling out relevant columns
fs_nash_inc_2021 = fs_nash_inc_2021.loc[:,['FAMILY INCOME BY NUMBER OF WORKERS IN FAMILY','Unnamed: 1','Unnamed: 5']]

#renaming column
fs_nash_inc_2021 = fs_nash_inc_2021.rename(columns = {'FAMILY INCOME BY NUMBER OF WORKERS IN FAMILY':'family_size',
                                                      'Unnamed: 1': 'household_count',
                                                      'Unnamed: 5':'avg_income'})

#stripping extra space in column
fs_nash_inc_2021['family_size'] = fs_nash_inc_2021['family_size'].str.strip()

#consolidating table
fs_nash_inc_2021 = fs_nash_inc_2021.loc[(fs_nash_inc_2021['family_size']=='1 worker')|
                                        (fs_nash_inc_2021['family_size']=='2 workers, husband and wife worked')|
                                        (fs_nash_inc_2021['family_size']=='2 workers, other')|
                                        (fs_nash_inc_2021['family_size']=='3 or more workers, husband and wife worked')|
                                        (fs_nash_inc_2021['family_size']=='3 or more workers, other')].reset_index(drop=True)

#add year column
fs_nash_inc_2021['year'] = 2021

#reorder columns 
fs_nash_inc_2021 = fs_nash_inc_2021.loc[:,['family_size', 'year','household_count','avg_income']]

fs_nash_inc_2021.head()

                family_size  year household_count avg_income
0                  1 worker  2021          52,561     84,626
1          2 workers, other  2021          18,748     94,993
2  3 or more workers, other  2021           5,570    147,444

In [ ]:
#Rename columns
one_bed_value = one_bed_value.rename(columns = {'RegionName':'City','StateName':'State', 'home_value': '1br_value'})

#convert date columns to datetime
one_bed_value['date']= pd.to_datetime(one_bed_value['date'])

#pick out specific time period
one_bed_value = one_bed_value.loc[one_bed_value['date']>='2018-03-31']

one_bed_value.head()

In [ ]:
#Rename columns
two_bed_value = two_bed_value.rename(columns = {'RegionName':'City','StateName':'State'})

#convert date columns to datetime
two_bed_value['date']= pd.to_datetime(two_bed_value['date'])

#pick out specific time period
two_bed_value = two_bed_value.loc[two_bed_value['date']>='2018-03-31']

two_bed_value.head()

In [ ]:
#Rename columns
three_bed_value = three_bed_value.rename(columns = {'RegionName':'City','StateName':'State'})

#convert date columns to datetime
three_bed_value['date']= pd.to_datetime(three_bed_value['date'])

#pick out specific time period
three_bed_value = three_bed_value.loc[three_bed_value['date']>='2018-03-31']

three_bed_value.head()

In [ ]:
#Rename columns
four_bed_value = four_bed_value.rename(columns = {'RegionName':'City','StateName':'State'})

#convert date columns to datetime
four_bed_value['date']= pd.to_datetime(four_bed_value['date'])

#pick out specific time period
four_bed_value = four_bed_value.loc[four_bed_value['date']>='2018-03-31']

four_bed_value.head()

In [ ]:
#Rename columns
five_bed_value = five_bed_value.rename(columns = {'RegionName':'City','StateName':'State'})

#convert date columns to datetime
five_bed_value['date']= pd.to_datetime(five_bed_value['date'])

#pick out specific time period
five_bed_value = five_bed_value.loc[five_bed_value['date']>='2018-03-31']

five_bed_value.head()

In [ ]:
#Atlanta one bed value
atl_one_bed = one_bed_value.loc[one_bed_value['City']=='Atlanta, GA']
atl_one_bed = atl_one_bed.reset_index(drop=True)
atl_one_bed.head()

In [ ]:
#Atlanta two bed value
atl_two_bed = two_bed_value.loc[two_bed_value['City']=='Atlanta, GA']
atl_two_bed = atl_two_bed.reset_index(drop=True)
atl_two_bed.head()

In [ ]:
#Atlanta three bed value
atl_three_bed = three_bed_value.loc[three_bed_value['City']=='Atlanta, GA']
atl_three_bed = atl_three_bed.reset_index(drop=True)
atl_three_bed.head()

In [ ]:
#Atlanta four bed value
atl_four_bed = four_bed_value.loc[four_bed_value['City']=='Atlanta, GA']
atl_four_bed = atl_four_bed.reset_index(drop=True)
atl_four_bed.head()

In [ ]:
#Atlanta five bed value
atl_five_bed = five_bed_value.loc[five_bed_value['City']=='Atlanta, GA']
atl_five_bed = atl_five_bed.reset_index(drop=True)
atl_five_bed.head()

In [ ]:
#Nashville one bed value
nash_one_bed = one_bed_value.loc[one_bed_value['City']=='Nashville, TN']
nash_one_bed = nash_one_bed.reset_index(drop=True)
nash_one_bed.head()

In [ ]:
#Nashville two bed value
nash_two_bed = two_bed_value.loc[two_bed_value['City']=='Nashville, TN']
nash_two_bed = nash_two_bed.reset_index(drop=True)
nash_two_bed.head()

In [ ]:
#Nashville three bed value
nash_three_bed = three_bed_value.loc[three_bed_value['City']=='Nashville, TN']
nash_three_bed = nash_three_bed.reset_index(drop=True)
nash_three_bed.head()

In [ ]:
#Nashville four bed value
nash_four_bed = four_bed_value.loc[four_bed_value['City']=='Nashville, TN']
nash_four_bed = nash_four_bed.reset_index(drop=True)
nash_four_bed.head()

In [ ]:
#Nashville five bed value
nash_five_bed = five_bed_value.loc[five_bed_value['City']=='Nashville, TN']
nash_five_bed = nash_five_bed.reset_index(drop=True)
nash_five_bed.head()

In [ ]:
#Austin one bed value
austin_one_bed = one_bed_value.loc[one_bed_value['City']=='Austin, TX']
austin_one_bed = austin_one_bed.reset_index(drop=True)
austin_one_bed.head()

In [ ]:
#Austin two bed value
austin_two_bed = two_bed_value.loc[two_bed_value['City']=='Austin, TX']
austin_two_bed = austin_two_bed.reset_index(drop=True)
austin_two_bed.head()

In [ ]:
#Austin three bed value
austin_three_bed = three_bed_value.loc[three_bed_value['City']=='Austin, TX']
austin_three_bed = austin_three_bed.reset_index(drop=True)
austin_three_bed.head()

In [ ]:
#Austin four bed value
austin_four_bed = four_bed_value.loc[four_bed_value['City']=='Austin, TX']
austin_four_bed = austin_four_bed.reset_index(drop=True)
austin_four_bed.head()

In [ ]:
#Austin five bed value
austin_five_bed = five_bed_value.loc[five_bed_value['City']=='Austin, TX']
austin_five_bed = austin_five_bed.reset_index(drop=True)
austin_five_bed.head()

In [ ]:
atl_sales_count.to_csv('../data/cleaned/housing/atl_sales_count.csv', index = False)

In [ ]:
atl_inventory.to_csv('../data/cleaned/housing/atl_inventory.csv', index = False)

In [ ]:
atl_list_price.to_csv('../data/cleaned/housing/atl_list_price.csv', index = False)

In [ ]:
atl_forecast.to_csv('../data/cleaned/housing/atl_forecast.csv', index = False)

In [ ]:
atl_one_bed.to_csv('../data/cleaned/housing/atl_one_bed.csv', index = False)

In [ ]:
atl_two_bed.to_csv('../data/cleaned/housing/atl_two_bed.csv', index = False)

In [ ]:
atl_three_bed.to_csv('../data/cleaned/housing/atl_three_bed.csv', index = False)

In [ ]:
atl_four_bed.to_csv('../data/cleaned/housing/atl_four_bed.csv', index = False)

In [ ]:
atl_five_bed.to_csv('../data/cleaned/housing/atl_five_bed.csv', index = False)

In [ ]:
nash_sales_count.to_csv('../data/cleaned/housing/nash_sales_count.csv', index = False)

In [ ]:
nash_inventory.to_csv('../data/cleaned/housing/nash_inventory.csv', index = False)

In [ ]:
nash_list_price.to_csv('../data/cleaned/housing/nash_list_price.csv', index = False)

In [ ]:
nash_forecast.to_csv('../data/cleaned/housing/nash_forecast.csv', index = False)

In [ ]:
nash_one_bed.to_csv('../data/cleaned/housing/nash_one_bed.csv', index = False)

In [ ]:
nash_two_bed.to_csv('../data/cleaned/housing/nash_two_bed.csv', index = False)

In [ ]:
nash_three_bed.to_csv('../data/cleaned/housing/nash_three_bed.csv', index = False)

In [ ]:
nash_four_bed.to_csv('../data/cleaned/housing/nash_four_bed.csv', index = False)

In [ ]:
nash_five_bed.to_csv('../data/cleaned/housing/nash_five_bed.csv', index = False)

In [ ]:
austin_sales_count.to_csv('../data/cleaned/housing/austin_sales_count.csv', index = False)

In [ ]:
austin_inventory.to_csv('../data/cleaned/housing/austin_inventory.csv', index = False)

In [ ]:
austin_list_price.to_csv('../data/cleaned/housing/austin_list_price.csv', index = False)

In [ ]:
austin_forecast.to_csv('../data/cleaned/housing/austin_forecast.csv', index = False)

In [ ]:
austin_one_bed.to_csv('../data/cleaned/housing/austin_one_bed.csv', index = False)

In [ ]:
austin_two_bed.to_csv('../data/cleaned/housing/austin_two_bed.csv', index = False)

In [ ]:
austin_three_bed.to_csv('../data/cleaned/housing/austin_three_bed.csv', index = False)

In [ ]:
austin_four_bed.to_csv('../data/cleaned/housing/austin_four_bed.csv', index = False)

In [ ]:
austin_five_bed.to_csv('../data/cleaned/housing/austin_five_bed.csv', index = False)